In [1]:
import sqlite3

In [2]:
sqlite3.version

'2.6.0'

In [3]:
con = sqlite3.connect("./Student.db")
#Connect to database

In [4]:
cur = con.cursor()
#Helps us manipulate the database

In [16]:
#Inserts data
cur.execute('insert into students (fname,lname,dob,gender,phone) values("Josh","Ndubi","12/10/2010","Male",0716321268)')
cur.execute('insert into students (fname,lname,dob,gender,phone) values("Milicent","Wamaitha","09/09/2009","Female",0712621268)')
cur.execute('insert into students (fname,lname,dob,gender,phone) values("Jacob","Wakazi","08/08/2007","Male",0712361268)')
cur.execute('insert into students (fname,lname,dob,gender,phone) values("Marion","Wajosefu","06/05/2004","Female",0712326268)')
#The fields are not necessary
cur.execute('insert into students values("Marlene","Wajosefu","06/05/2003","Female",0712326668)')
#Commits changes
con.commit()

In [6]:
#(*)To select all fields
cur.execute('SELECT * FROM students')
#Fetch all fields
cur.fetchall()

[('Storm', 'Gachoki', '12/02/2003', 'Male', 797327921),
 ('Mandy', 'Wanjiku', '23/03/2001', 'Female', 823792373),
 ('Austin', 'Anyango', '21/04/2000', 'Male', 723982732),
 ('Lisa', 'Odula', '20/05/1998', 'Female', 2525551255),
 ('John', 'Mbiso', '24/03/1976', 'Male', 723482634),
 ('name1', 'new lname', '12/12/12', 'M', 712321268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('Lucy', 'Wamaitha', '09/09/09', 'Female', 712621268),
 ('Job', 'Wakazi', '08/08/07', 'Male', 712361268),
 ('Mary', 'Wajosefu', '06/05/04', 'Female', 712326268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('Lucy', 'Wamaitha', '09/09/09', 'Female', 712621268),
 ('Job', 'Wakazi', '08/08/07', 'Male', 712361268),
 ('Mary', 'Wajosefu', '06/05/04', 'Female', 712326268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('Lucy', 'Wamaitha', '09/09/09', 'Female', 712621268),
 ('Job', 'Wakazi', '08/08/07', 'Male', 712361268),
 ('Mary', 'Wajosefu', '06/05/04', 'Female', 712326268)]

In [7]:
#(*)To select all fields
cur.execute('SELECT * FROM students')
#Fetch first one 
cur.fetchone()

('Storm', 'Gachoki', '12/02/2003', 'Male', 797327921)

In [8]:
#Fetch specific fields
cur.execute('SELECT fname FROM students')
cur.fetchall()

[('Storm',),
 ('Mandy',),
 ('Austin',),
 ('Lisa',),
 ('John',),
 ('name1',),
 ('James',),
 ('Lucy',),
 ('Job',),
 ('Mary',),
 ('James',),
 ('Lucy',),
 ('Job',),
 ('Mary',),
 ('James',),
 ('Lucy',),
 ('Job',),
 ('Mary',)]

In [9]:
#Select 'Storm' in fname
cur.execute('SELECT * FROM students WHERE fname="Storm"')
cur.fetchall()

[('Storm', 'Gachoki', '12/02/2003', 'Male', 797327921)]

In [10]:
#Select a specific dob
cur.execute('SELECT * FROM students WHERE dob="12/12/12"')
cur.fetchall()

[('name1', 'new lname', '12/12/12', 'M', 712321268)]

In [11]:
#Select records for "Males"
cur.execute('SELECT * FROM students WHERE gender="Male" OR gender = "M"')
cur.fetchall()

[('Storm', 'Gachoki', '12/02/2003', 'Male', 797327921),
 ('Austin', 'Anyango', '21/04/2000', 'Male', 723982732),
 ('John', 'Mbiso', '24/03/1976', 'Male', 723482634),
 ('name1', 'new lname', '12/12/12', 'M', 712321268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('Job', 'Wakazi', '08/08/07', 'Male', 712361268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('Job', 'Wakazi', '08/08/07', 'Male', 712361268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('Job', 'Wakazi', '08/08/07', 'Male', 712361268)]

In [12]:
#Select records for "Females"
cur.execute('SELECT * FROM students WHERE gender="Female"')
cur.fetchall()

[('Mandy', 'Wanjiku', '23/03/2001', 'Female', 823792373),
 ('Lisa', 'Odula', '20/05/1998', 'Female', 2525551255),
 ('Lucy', 'Wamaitha', '09/09/09', 'Female', 712621268),
 ('Mary', 'Wajosefu', '06/05/04', 'Female', 712326268),
 ('Lucy', 'Wamaitha', '09/09/09', 'Female', 712621268),
 ('Mary', 'Wajosefu', '06/05/04', 'Female', 712326268),
 ('Lucy', 'Wamaitha', '09/09/09', 'Female', 712621268),
 ('Mary', 'Wajosefu', '06/05/04', 'Female', 712326268)]

In [13]:
#Select data in phone that starts with '072...' 
cur.execute('SELECT * FROM students WHERE phone like "72%"')
cur.fetchall()

[('Austin', 'Anyango', '21/04/2000', 'Male', 723982732),
 ('John', 'Mbiso', '24/03/1976', 'Male', 723482634)]

In [14]:
#Select data in fname with an 's' in the name
cur.execute('SELECT * FROM students WHERE fname like "%s%"')
cur.fetchall()

[('Storm', 'Gachoki', '12/02/2003', 'Male', 797327921),
 ('Austin', 'Anyango', '21/04/2000', 'Male', 723982732),
 ('Lisa', 'Odula', '20/05/1998', 'Female', 2525551255),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268),
 ('James', 'Ndubi', '12/10/10', 'Male', 716321268)]

In [15]:
#Updating the table
cur.execute('UPDATE students set lname ="new lname" WHERE fname = "name1"')#Updating a table
#Commiting the changes
con.commit()
#Selecting the students
cur.execute('SELECT * FROM students WHERE fname = "name1"')
cur.fetchall()

[('name1', 'new lname', '12/12/12', 'M', 712321268)]

In [17]:
cur.execute('DELETE FROM students WHERE fname = "name1"')
con.commit()

In [18]:
cur.execute('DELETE FROM students WHERE fname = "Marion"')
con.commit()

In [19]:
cur.execute('DELETE FROM students WHERE dob = "08/08/2007"')
con.commit()